---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures
source: html/cbf04b90-5dac-ad01-1aa8-f9653ea4aff1.htm
---
# BuiltInFailures.AutoRouteFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.